# SetTool

## Description
Activates the specified VectorWorks tool for use. The tool remains selected as the active tool after use.

Note: Please refer to the Script Appendix for specific tool ID values.

```pascal
PROCEDURE SetTool(theTool : INTEGER);
```

```python
def vs.SetTool(theTool):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theTool|INTEGER|VectorWorks tool constant.|

## Examples
#### VectorScript ####
```pascal
SetTool(-203);
```
#### Python ####
```python
vs.SetTool(-241)
```

```pascal
SetTool(1);
```
```python
import vs

# Activates the specified VectorWorks tool for use.
theTool = 1

vs.SetTool(theTool)
```

## See Also
VS Functions:
CallTool

## Version
Availability: from All Versions

## Category
* Command